package com.elon;

import org.apache.commons.lang3.StringUtils;

/**
 * 矩阵
 */
public class JamaUtil {

    public static void main(String[] args) {
        //精彩
        String src = "1010101110001|0101000000000|0000001100000|0000000000000|0001000100010|0000000000000|1000010011000|0000000000000|0000000000000|0000000000000|0000000000000|0010010010000|0000000000000|0001000100010|0000000000000|0010000110010|0000000000000|0000000000000|0000000000000|0000000000000|1000100001000|0000000000000|0001000000000|0000000000000|0101000000000|0000000000000|0000000000000|0000000000000|0000000000000|1000000000000|0000000000000|0000010010000|0000000000000|0000000000000|0000000000000";
        src = "0111110011100|0000000000000|0100010001000|0000000000000|1000010011000|0000000000000|0000000000000|0000000000000|0100100010000|0000000000000|0100000010000|0000000000000|0000000000000|0000000000000|";
        src = "0111110011100|0000000000000|0100010001000|0000000000000|1000010011000|0000000000000|1100110011000|0000000000000|0100100010000|0000000000000|0100000010000|0000000000000|0000000000000|0000000000000|";
        src = "1000110011100|0000000000000|0100010001000|0000000000000|1000010011000|0000000000000|0000000000000|0000000000000|1000100010000|0000000000000|0100000001000|0000000000000|0000000000000|0000000000000|";
        //11选5
        src = "0010111000010|0000100000000|1111100000000|0000000000000|1111100000000|0000000000000|0000000000000|0000000000000|0000000000000|0000000000000|0000000000000|0000000000000|0000000000000|0010000000000|0000000000000|0000000000000";
        //大乐透
        src = "1110111000001|0000010000000|0000000000000|0100000000000|0100000000000|0100000000010|0100000000010|0100000000000|0000000001000|0010000001000|0110000000000|0100000000000|0100000000000|0100000000000|0100000000000|0100000000010|0100000000010|0100000000000|0100000000000|0100000000000|0100000000010|0100000000010|0100000000000|0100000000000|0100000000000|0100000000010|0100000000010|0100000000000|0000000000000|0010000000000|0000000000000|0010000000001";
        String matrix = convertData(src);
        System.out.println(matrix);
        System.out.println(culate(2,3));

    }

    public static String convertData(String src) {
        String gap_firstBlack = "100000000000000";//间隔 第一个是黑点
        String gap_lastBlack = "000000000000001";//最后一行 最后一个点是黑点
        String[] srcs = src.split("\\|");
        StringBuilder everyLine_ = new StringBuilder();
        StringBuilder valideData = new StringBuilder();
        for (int i = 0; i < srcs.length; i++) {
            String everyLine = srcs[i];
            if (StringUtils.isNotEmpty(everyLine)) {
                everyLine_.append(gap_firstBlack);
                everyLine_.append("|");
                everyLine_.append("0").append(everyLine).append("0");
                everyLine_.append("|");
                if (i == srcs.length - 1) {
                    everyLine_.append(gap_firstBlack);
                    everyLine_.append("|");
                    everyLine_.append(gap_lastBlack);
                }
            }
        }
        System.out.println(everyLine_);
        System.out.println("============================================");
        if (StringUtils.isNotEmpty(everyLine_)) {
            String[] validLines = everyLine_.toString().split("\\|");
            for (int i = 0; i < 15; i++) {
                for (int j = validLines.length - 1; j >= 0; j--) {
                    String validLine = validLines[j];
                    valideData.append(validLine.charAt(i));
                }
                valideData.append("\n");
            }
        }
        return valideData.toString();
    }

    public static int culate(int a,int b){
        a = a + b;
        return a;
    }
}
